tutorials/realFOAM/1D_C12H26_ECN_OP_6MPa/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.1;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
	(0   0     0)
	(1   0     0)
	(1   1  0)
	(0   1  0)
	(0   0     0.1)
        (1   0     0.1)
        (1   1  0.1)
        (0   1  0.1)
);

blocks          
(
	hex (0 1 2 3 4 5 6 7) (101 1 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
	Inlet
	{
	    type inlet;
    	    faces 
    		(
		(0 4 7 3)
    		);
	}
	Outlet
	{
	    type outlet;
	    faces
		(
		(2 6 5 1)
		);
	}
	frontAndBack
	{
	    type empty;
	    faces
		(
		(3 7 6 2)
		(1 5 4 0)
		(0 3 2 1)
		(4 5 6 7)
		);
	} 
);

mergePatchPairs
(
);

// ************************************************************************* //
