tutorials/realFOAM/1D_C12H26_ECN_OP_6MPa/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         realThermoSCFoam;

startFrom           startTime;

startTime           0;

stopAt              writeNow;

endTime             1e-4;

deltaT              1e-7;

writeControl        runTime;

writeInterval       1e-2;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

timeFormat          general;

timePrecision       6;

adjustTimeStep      no;

functions
{
    #includeFunc  graphCell
}
// ************************************************************************* //
