tutorials/realFOAM/1D_C12H26_ECN_OP_6MPa/system/graphCell
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. One graph point is generated in each cell that the line
    intersects.

\*---------------------------------------------------------------------------*/

start           (0 0 0);
end             (0.1 0 0);

fields          (T rho);

axis            "x";
#includeEtc "caseDicts/postProcessing/graphs/graphCell.cfg"

// ************************************************************************* //
